; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=4, packages=7, locations=10, density=0.2222222222222222, fully_connected=False, max_capacity=2, out_folder=./sparse/training, instance_id=15, seed=56

(define (problem transport-15)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l4)
    (at p2 l2)
    (at p3 l6)
    (at p4 l10)
    (at p5 l2)
    (at p6 l6)
    (at p7 l5)
    (at v1 l10)
    (at v2 l4)
    (at v3 l1)
    (at v4 l10)
    (road l2 l7)
    (road l5 l9)
    (road l6 l9)
    (road l10 l5)
    (road l5 l10)
    (road l3 l2)
    (road l4 l10)
    (road l7 l1)
    (road l10 l4)
    (road l8 l5)
    (road l2 l3)
    (road l8 l7)
    (road l9 l6)
    (road l9 l5)
    (road l7 l2)
    (road l7 l8)
    (road l5 l8)
    (road l1 l7)
    (road l4 l9)
    (road l9 l4)
    )
 (:goal  (and 
    (at p1 l3)
    (at p2 l6)
    (at p3 l8)
    (at p4 l3)
    (at p5 l1)
    (at p6 l4)
    (at p7 l3))))

; plan
1. (drive v3 l1 l7)
   deleted: (at v3 l1)
   added: (at v3 l7)
   goals met: 0 of 7
2. (drive v3 l7 l8)
   deleted: (at v3 l7)
   added: (at v3 l8)
   goals met: 0 of 7
3. (drive v2 l4 l9)
   deleted: (at v2 l4)
   added: (at v2 l9)
   goals met: 0 of 7
4. (drive v2 l9 l6)
   deleted: (at v2 l9)
   added: (at v2 l6)
   goals met: 0 of 7
5. (pick-up v2 l6 p3 c1 c2)
   deleted: (at p3 l6) (capacity v2 c2)
   added: (in p3 v2) (capacity v2 c1)
   goals met: 0 of 7
6. (pick-up v2 l6 p6 c0 c1)
   deleted: (at p6 l6) (capacity v2 c1)
   added: (in p6 v2) (capacity v2 c0)
   goals met: 0 of 7
7. (pick-up v1 l10 p4 c0 c1)
   deleted: (at p4 l10) (capacity v1 c1)
   added: (in p4 v1) (capacity v1 c0)
   goals met: 0 of 7
8. (drive v1 l10 l5)
   deleted: (at v1 l10)
   added: (at v1 l5)
   goals met: 0 of 7
9. (drive v1 l5 l8)
   deleted: (at v1 l5)
   added: (at v1 l8)
   goals met: 0 of 7
10. (drive v1 l8 l7)
   deleted: (at v1 l8)
   added: (at v1 l7)
   goals met: 0 of 7
11. (drive v1 l7 l2)
   deleted: (at v1 l7)
   added: (at v1 l2)
   goals met: 0 of 7
12. (drive v1 l2 l3)
   deleted: (at v1 l2)
   added: (at v1 l3)
   goals met: 0 of 7
13. (drop v1 l3 p4 c0 c1)
   deleted: (in p4 v1) (capacity v1 c0)
   added: (at p4 l3) (capacity v1 c1)
   goals met: 1 of 7
14. (drive v1 l3 l2)
   deleted: (at v1 l3)
   added: (at v1 l2)
   goals met: 1 of 7
15. (drive v2 l6 l9)
   deleted: (at v2 l6)
   added: (at v2 l9)
   goals met: 1 of 7
16. (drive v2 l9 l4)
   deleted: (at v2 l9)
   added: (at v2 l4)
   goals met: 1 of 7
17. (drop v2 l4 p6 c0 c1)
   deleted: (in p6 v2) (capacity v2 c0)
   added: (at p6 l4) (capacity v2 c1)
   goals met: 2 of 7
18. (pick-up v1 l2 p2 c0 c1)
   deleted: (at p2 l2) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 2 of 7
19. (pick-up v2 l4 p1 c0 c1)
   deleted: (at p1 l4) (capacity v2 c1)
   added: (in p1 v2) (capacity v2 c0)
   goals met: 2 of 7
20. (drive v2 l4 l9)
   deleted: (at v2 l4)
   added: (at v2 l9)
   goals met: 2 of 7
21. (drive v2 l9 l5)
   deleted: (at v2 l9)
   added: (at v2 l5)
   goals met: 2 of 7
22. (drive v2 l5 l8)
   deleted: (at v2 l5)
   added: (at v2 l8)
   goals met: 2 of 7
23. (drop v2 l8 p3 c0 c1)
   deleted: (in p3 v2) (capacity v2 c0)
   added: (at p3 l8) (capacity v2 c1)
   goals met: 3 of 7
24. (drive v2 l8 l5)
   deleted: (at v2 l8)
   added: (at v2 l5)
   goals met: 3 of 7
25. (pick-up v2 l5 p7 c0 c1)
   deleted: (at p7 l5) (capacity v2 c1)
   added: (in p7 v2) (capacity v2 c0)
   goals met: 3 of 7
26. (drive v2 l5 l8)
   deleted: (at v2 l5)
   added: (at v2 l8)
   goals met: 3 of 7
27. (drive v2 l8 l7)
   deleted: (at v2 l8)
   added: (at v2 l7)
   goals met: 3 of 7
28. (drive v2 l7 l2)
   deleted: (at v2 l7)
   added: (at v2 l2)
   goals met: 3 of 7
29. (drive v2 l2 l3)
   deleted: (at v2 l2)
   added: (at v2 l3)
   goals met: 3 of 7
30. (drop v2 l3 p1 c0 c1)
   deleted: (in p1 v2) (capacity v2 c0)
   added: (at p1 l3) (capacity v2 c1)
   goals met: 4 of 7
31. (drop v2 l3 p7 c1 c2)
   deleted: (in p7 v2) (capacity v2 c1)
   added: (at p7 l3) (capacity v2 c2)
   goals met: 5 of 7
32. (drive v1 l2 l7)
   deleted: (at v1 l2)
   added: (at v1 l7)
   goals met: 5 of 7
33. (drive v1 l7 l8)
   deleted: (at v1 l7)
   added: (at v1 l8)
   goals met: 5 of 7
34. (drive v1 l8 l5)
   deleted: (at v1 l8)
   added: (at v1 l5)
   goals met: 5 of 7
35. (drive v1 l5 l9)
   deleted: (at v1 l5)
   added: (at v1 l9)
   goals met: 5 of 7
36. (drive v1 l9 l6)
   deleted: (at v1 l9)
   added: (at v1 l6)
   goals met: 5 of 7
37. (drop v1 l6 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l6) (capacity v1 c1)
   goals met: 6 of 7
38. (drive v3 l8 l7)
   deleted: (at v3 l8)
   added: (at v3 l7)
   goals met: 6 of 7
39. (drive v3 l7 l2)
   deleted: (at v3 l7)
   added: (at v3 l2)
   goals met: 6 of 7
40. (pick-up v3 l2 p5 c1 c2)
   deleted: (at p5 l2) (capacity v3 c2)
   added: (in p5 v3) (capacity v3 c1)
   goals met: 6 of 7
41. (drive v3 l2 l7)
   deleted: (at v3 l2)
   added: (at v3 l7)
   goals met: 6 of 7
42. (drive v3 l7 l1)
   deleted: (at v3 l7)
   added: (at v3 l1)
   goals met: 6 of 7
43. (drop v3 l1 p5 c1 c2)
   deleted: (in p5 v3) (capacity v3 c1)
   added: (at p5 l1) (capacity v3 c2)
   goals met: 7 of 7
